# DataFrame 복사, 인덱싱, 정렬, groupby

In [1]:
import pandas as pd

## DataFrame 로딩

In [8]:
df = pd.read_csv("datas/korea-star.csv")
df.head(3)

    이름     그룹   소속사  성별        생년월일      키 혈액형     인기지수
0  아이린   레드벨벳    SM  여자  1991-03-29  160.0   A  8256324
1  차은우   아스트로  판타지오  남자  1997-03-30  183.0   B  3506027
2    뷔  방탄소년단   빅히트  남자  1995-12-30  178.0  AB  8073501

### 1. 대입과 복사

복사

df를 **새로운 변수(new_df)에 대입** 후<br>
새로운 변수에서 값을 바꾼다면,<br>
원래의 DataFrame의 값은 어떻게 될까요?

In [9]:
new_df = df

In [10]:
new_df.head()

    이름     그룹   소속사  성별        생년월일      키 혈액형     인기지수
0  아이린   레드벨벳    SM  여자  1991-03-29  160.0   A  8256324
1  차은우   아스트로  판타지오  남자  1997-03-30  183.0   B  3506027
2    뷔  방탄소년단   빅히트  남자  1995-12-30  178.0  AB  8073501
3   민현    NaN  플레디스  남자  1995-08-09  182.3   O  4989792
4   소연    아이들    큐브  여자  1998-08-26    NaN   B  4668615

In [5]:
new_df['이름'] = 0

In [6]:
new_df.head()

   이름     그룹   소속사  성별        생년월일      키 혈액형     인기지수
0   0   레드벨벳    SM  여자  1991-03-29  160.0   A  8256324
1   0   아스트로  판타지오  남자  1997-03-30  183.0   B  3506027
2   0  방탄소년단   빅히트  남자  1995-12-30  178.0  AB  8073501
3   0    NaN  플레디스  남자  1995-08-09  182.3   O  4989792
4   0    아이들    큐브  여자  1998-08-26    NaN   B  4668615

In [7]:
df.head()

   이름     그룹   소속사  성별        생년월일      키 혈액형     인기지수
0   0   레드벨벳    SM  여자  1991-03-29  160.0   A  8256324
1   0   아스트로  판타지오  남자  1997-03-30  183.0   B  3506027
2   0  방탄소년단   빅히트  남자  1995-12-30  178.0  AB  8073501
3   0    NaN  플레디스  남자  1995-08-09  182.3   O  4989792
4   0    아이들    큐브  여자  1998-08-26    NaN   B  4668615

In [11]:
hex(id(new_df))

'0x1c7d0fbaa00'

In [12]:
hex(id(df))

'0x1c7d0fbaa00'

왜 df 도 같이 바뀌는 걸까?<br>
<span style="background-color:#FFE6E6"> 이유는 같은 메모리 주소를 참조하기 때문이다. </span>

## DataFrame 복사
### 새로운 데이터 생성 방법

In [13]:
df_copy = df.copy()
df_copy

      이름     그룹      소속사  성별        생년월일      키 혈액형      인기지수
0    아이린   레드벨벳       SM  여자  1991-03-29  160.0   A   8256324
1    차은우   아스트로     판타지오  남자  1997-03-30  183.0   B   3506027
2      뷔  방탄소년단      빅히트  남자  1995-12-30  178.0  AB   8073501
3     민현    NaN     플레디스  남자  1995-08-09  182.3   O   4989792
4     소연    아이들       큐브  여자  1998-08-26    NaN   B   4668615
5      진  방탄소년단      빅히트  남자  1992-12-04  179.2   O   4570308
6     윤아   소녀시대       SM  여자  1989-03-09    NaN   A   3918661
7     백호   뉴이스트     플레디스  남자  1995-07-21  175.0  AB   3301654
8     JR   뉴이스트     플레디스  남자  1995-06-08  176.0   O   3274137
9     슈가  방탄소년단      빅히트  남자  1993-03-09  174.0   O   4925442
10  강다니엘    NaN      커넥트  남자  1996-12-10  180.0   A   8273745
11    정국  방탄소년단      빅히트  남자  1997-09-01  178.0   A   7208335
12    화사    마마무      RBW  여자  1995-07-23  162.1   A   7650928
13   하성운     핫샷  스타크루이엔티  남자  1994-03-22  167.1   A   4036489
14    슬기   레드벨벳       SM  여자  1994-02-10  161.0   A   5021452
15    지민  방탄소년단      빅히트  남자  1995-10-13  173.6   A  10523260

In [14]:
hex(id(df))

'0x1c7d0fbaa00'

In [15]:
hex(id(df_copy))

'0x1c7c8973820'

In [16]:
df.head()

    이름     그룹   소속사  성별        생년월일      키 혈액형     인기지수
0  아이린   레드벨벳    SM  여자  1991-03-29  160.0   A  8256324
1  차은우   아스트로  판타지오  남자  1997-03-30  183.0   B  3506027
2    뷔  방탄소년단   빅히트  남자  1995-12-30  178.0  AB  8073501
3   민현    NaN  플레디스  남자  1995-08-09  182.3   O  4989792
4   소연    아이들    큐브  여자  1998-08-26    NaN   B  4668615

In [17]:
df_copy.head()

    이름     그룹   소속사  성별        생년월일      키 혈액형     인기지수
0  아이린   레드벨벳    SM  여자  1991-03-29  160.0   A  8256324
1  차은우   아스트로  판타지오  남자  1997-03-30  183.0   B  3506027
2    뷔  방탄소년단   빅히트  남자  1995-12-30  178.0  AB  8073501
3   민현    NaN  플레디스  남자  1995-08-09  182.3   O  4989792
4   소연    아이들    큐브  여자  1998-08-26    NaN   B  4668615

In [18]:
df_copy['인기지수'] = 0

In [19]:
df_copy.head()

    이름     그룹   소속사  성별        생년월일      키 혈액형  인기지수
0  아이린   레드벨벳    SM  여자  1991-03-29  160.0   A     0
1  차은우   아스트로  판타지오  남자  1997-03-30  183.0   B     0
2    뷔  방탄소년단   빅히트  남자  1995-12-30  178.0  AB     0
3   민현    NaN  플레디스  남자  1995-08-09  182.3   O     0
4   소연    아이들    큐브  여자  1998-08-26    NaN   B     0

In [20]:
df.head()

    이름     그룹   소속사  성별        생년월일      키 혈액형     인기지수
0  아이린   레드벨벳    SM  여자  1991-03-29  160.0   A  8256324
1  차은우   아스트로  판타지오  남자  1997-03-30  183.0   B  3506027
2    뷔  방탄소년단   빅히트  남자  1995-12-30  178.0  AB  8073501
3   민현    NaN  플레디스  남자  1995-08-09  182.3   O  4989792
4   소연    아이들    큐브  여자  1998-08-26    NaN   B  4668615

In [21]:
# df_copy 삭제 하려면
del df_copy

In [23]:
df_copy # del로 메모리에서 삭제 됨

NameError: name 'df_copy' is not defined

## 2. row, column 추가 및 삭제

### 2-1. row의 추가

dict type 데이터를 **append()** 함수를 사용하여 추가할 수 있음.
dict 타입으로 컬럼의 데이터를 추가할 때는 반드시,
**ignore_index=True** 옵션을 같이 추가해야 에러가 안남.

In [25]:
print(df.head(3))

    이름     그룹   소속사  성별        생년월일      키 혈액형     인기지수
0  아이린   레드벨벳    SM  여자  1991-03-29  160.0   A  8256324
1  차은우   아스트로  판타지오  남자  1997-03-30  183.0   B  3506027
2    뷔  방탄소년단   빅히트  남자  1995-12-30  178.0  AB  8073501

In [26]:
# 추가할 데이터
add_data = {'이름':'바니', '그룹':'바니그룹', '소속사':'안테나', 
           '성별':'여자', '생년월일':'1990-01-01', '키':195.0, 
           '혈액형':'O', '인기지수':7235678}

In [27]:
len(df)

16

In [35]:
df.loc[len(df)] = add_data

In [31]:
df.tail()

     이름     그룹      소속사  성별        생년월일      키 혈액형      인기지수
13  하성운     핫샷  스타크루이엔티  남자  1994-03-22  167.1   A   4036489
14   슬기   레드벨벳       SM  여자  1994-02-10  161.0   A   5021452
15   지민  방탄소년단      빅히트  남자  1995-10-13  173.6   A  10523260
16   바니   바니그룹      안테나  여자  1990-01-01  195.0   O   7235678
17   바니   바니그룹      안테나  여자  1990-01-01  195.0   O   7235678

In [32]:
# 추가할 데이터
add_data2 = {'이름':'아이유', '소속사':'이담엔터테인먼트', 
           '성별':'여자', '생년월일':'1990-01-01', '키':160.0, 
           '혈액형':'A', '인기지수':10235678}

In [33]:
df.loc[len(df)] = add_data2

In [36]:
df.tail()

     이름     그룹       소속사  성별        생년월일      키 혈액형      인기지수
15   지민  방탄소년단       빅히트  남자  1995-10-13  173.6   A  10523260
16   바니   바니그룹       안테나  여자  1990-01-01  195.0   O   7235678
17   바니   바니그룹       안테나  여자  1990-01-01  195.0   O   7235678
18  아이유    NaN  이담엔터테인먼트  여자  1990-01-01  160.0   A  10235678
19   바니   바니그룹       안테나  여자  1990-01-01  195.0   O   7235678

In [42]:
# 17번, 19번
df.drop([17, 19])

      이름     그룹       소속사  성별        생년월일      키 혈액형      인기지수
0    아이린   레드벨벳        SM  여자  1991-03-29  160.0   A   8256324
1    차은우   아스트로      판타지오  남자  1997-03-30  183.0   B   3506027
2      뷔  방탄소년단       빅히트  남자  1995-12-30  178.0  AB   8073501
3     민현    NaN      플레디스  남자  1995-08-09  182.3   O   4989792
4     소연    아이들        큐브  여자  1998-08-26    NaN   B   4668615
5      진  방탄소년단       빅히트  남자  1992-12-04  179.2   O   4570308
6     윤아   소녀시대        SM  여자  1989-03-09    NaN   A   3918661
7     백호   뉴이스트      플레디스  남자  1995-07-21  175.0  AB   3301654
8     JR   뉴이스트      플레디스  남자  1995-06-08  176.0   O   3274137
9     슈가  방탄소년단       빅히트  남자  1993-03-09  174.0   O   4925442
10  강다니엘    NaN       커넥트  남자  1996-12-10  180.0   A   8273745
11    정국  방탄소년단       빅히트  남자  1997-09-01  178.0   A   7208335
12    화사    마마무       RBW  여자  1995-07-23  162.1   A   7650928
13   하성운     핫샷   스타크루이엔티  남자  1994-03-22  167.1   A   4036489
14    슬기   레드벨벳        SM  여자  1994-02-10  161.0   A   5021452
15    지민  방탄소년단       빅히트  남자  1995-10-13  173.6   A  10523260
16    바니   바니그룹       안테나  여자  1990-01-01  195.0   O   7235678
18   아이유    NaN  이담엔터테인먼트  여자  1990-01-01  160.0   A  10235678

In [43]:
df.tail(5)

     이름     그룹       소속사  성별        생년월일      키 혈액형      인기지수
15   지민  방탄소년단       빅히트  남자  1995-10-13  173.6   A  10523260
16   바니   바니그룹       안테나  여자  1990-01-01  195.0   O   7235678
17   바니   바니그룹       안테나  여자  1990-01-01  195.0   O   7235678
18  아이유    NaN  이담엔터테인먼트  여자  1990-01-01  160.0   A  10235678
19   바니   바니그룹       안테나  여자  1990-01-01  195.0   O   7235678

In [ ]:
# 삭제하고 df 다시 대입해야 적용됨
df = df.drop([17, 19]) #  inplace = True 사용 가능
df.tail(5)

## 2-2. column 추가
**주의**<br>
<span style="background-color:#fff5b1"> 만약 데이터가 있을 경우 값이 update 되니 주의할 것 </span>

새로운 column을 만들고 값을 대입해주면, 자동으로 생성됨

In [46]:
df.head()

    이름     그룹   소속사  성별        생년월일      키 혈액형     인기지수
0  아이린   레드벨벳    SM  여자  1991-03-29  160.0   A  8256324
1  차은우   아스트로  판타지오  남자  1997-03-30  183.0   B  3506027
2    뷔  방탄소년단   빅히트  남자  1995-12-30  178.0  AB  8073501
3   민현    NaN  플레디스  남자  1995-08-09  182.3   O  4989792
4   소연    아이들    큐브  여자  1998-08-26    NaN   B  4668615

In [47]:
df['국적'] = '대한민국'

In [48]:
df.head()

    이름     그룹   소속사  성별        생년월일      키 혈액형     인기지수    국적
0  아이린   레드벨벳    SM  여자  1991-03-29  160.0   A  8256324  대한민국
1  차은우   아스트로  판타지오  남자  1997-03-30  183.0   B  3506027  대한민국
2    뷔  방탄소년단   빅히트  남자  1995-12-30  178.0  AB  8073501  대한민국
3   민현    NaN  플레디스  남자  1995-08-09  182.3   O  4989792  대한민국
4   소연    아이들    큐브  여자  1998-08-26    NaN   B  4668615  대한민국

#### **컬럼 전체에 동일한 값이 적용됨**
만약, 값을 변경하고 싶다면, loc 함수를 활용해서 변경할 수 있음

df.loc[ 조건부:df['column name*'] == '요소값' , 'update column name*'] = '대입값'

ex) df.loc[ df['이름'] == '차은우' , '국적'] = 'korea'

In [49]:
df.loc[ df['이름'] == '차은우' , '국적'] = 'korea'

In [50]:
df.head()

    이름     그룹   소속사  성별        생년월일      키 혈액형     인기지수     국적
0  아이린   레드벨벳    SM  여자  1991-03-29  160.0   A  8256324   대한민국
1  차은우   아스트로  판타지오  남자  1997-03-30  183.0   B  3506027  korea
2    뷔  방탄소년단   빅히트  남자  1995-12-30  178.0  AB  8073501   대한민국
3   민현    NaN  플레디스  남자  1995-08-09  182.3   O  4989792   대한민국
4   소연    아이들    큐브  여자  1998-08-26    NaN   B  4668615   대한민국

## 3. 통계값 다루기

In [51]:
df = pd.read_csv('datas/korea-star.csv')

통계값은 data type이 float나 int형 인 column을 다룸

In [52]:
df.head()

    이름     그룹   소속사  성별        생년월일      키 혈액형     인기지수
0  아이린   레드벨벳    SM  여자  1991-03-29  160.0   A  8256324
1  차은우   아스트로  판타지오  남자  1997-03-30  183.0   B  3506027
2    뷔  방탄소년단   빅히트  남자  1995-12-30  178.0  AB  8073501
3   민현    NaN  플레디스  남자  1995-08-09  182.3   O  4989792
4   소연    아이들    큐브  여자  1998-08-26    NaN   B  4668615

### 3-1. min(최소값), max(최대값)
통계값은 data type이 숫자형 인 column을 다룸

In [55]:
df_min = df["키"].min()
print(df_min)

160.0

In [56]:
df_max = df["키"].max()
print(df_max)

183.0

### 3-2. sum (합계), mean (평균)

In [53]:
df_sum = df["키"].sum()
print(df_sum)

2429.3

In [54]:
df_mean = df["키"].mean()
print(df_mean)

173.52142857142857

### 3-3. 분산(var; variance), 표준편차(std; standard deviation)
- 분산과 표준편차는 데이터가 **평균으로부터 얼마나 떨어져 있는지 정도**를 나타냄
- 분산은 **(데이터 - 평균) 2** 을 모두 합한 값** / n
- 표준편차는 **분산의 루트**

In [57]:
import numpy as np

In [58]:
data_01 = np.array([1, 3, 5, 7, 9])
data_02 = np.array([3, 4, 5, 6, 7])

In [59]:
np.sqrt(((1-5)**2 + (3-5)**2 + (5-5)**2 + (7-5)**2 + (9-5)**2 ) / 5)

2.8284271247461903

In [60]:
data_01.mean()

5.0

In [61]:
data_02.mean()

5.0

In [62]:
data_01.var(), data_02.var()

(8.0, 2.0)

In [63]:
np.sqrt(data_01.var()), np.sqrt(data_02.var())

(2.8284271247461903, 1.4142135623730951)

In [64]:
data_01.std(), data_02.std()

(2.8284271247461903, 1.4142135623730951)

주로 표준편자 (std)를 많이 사용하며, 데이터가 평균으로부터 얼마나 퍼져있는지 정도를 나타내는 지표

In [68]:
# df의 키컬럼 값의 분산
df["키"].var()

61.62335164835167

In [69]:
# df의 키컬럼 값의 표준편차
df["키"].std()

7.8500542449305195

### 3-4. 갯수를 세는 count

In [71]:
# df의 키컬럼 값의 갯수
df["키"].count()

14

### 3.5. 중앙값
- 오름차순으로 정렬한 다음에 그중에서 가장 가운데.

In [72]:
# df의 키컬럼 값의 중앙값
df['키'].median()

175.5

### 3.6. 최빈값 (mode)
- 얼마나 자주 나오는 인지

In [73]:
# df의 키컬럼 겂중에 최빈값
df['키'].mode()

0    178.0
Name: 키, dtype: float64

In [74]:
# 슈가의 키를 176으로 변경

df.loc[ df['이름'] == '슈가' , '키'] = 176

In [75]:
df

      이름     그룹      소속사  성별        생년월일      키 혈액형      인기지수
0    아이린   레드벨벳       SM  여자  1991-03-29  160.0   A   8256324
1    차은우   아스트로     판타지오  남자  1997-03-30  183.0   B   3506027
2      뷔  방탄소년단      빅히트  남자  1995-12-30  178.0  AB   8073501
3     민현    NaN     플레디스  남자  1995-08-09  182.3   O   4989792
4     소연    아이들       큐브  여자  1998-08-26    NaN   B   4668615
5      진  방탄소년단      빅히트  남자  1992-12-04  179.2   O   4570308
6     윤아   소녀시대       SM  여자  1989-03-09    NaN   A   3918661
7     백호   뉴이스트     플레디스  남자  1995-07-21  175.0  AB   3301654
8     JR   뉴이스트     플레디스  남자  1995-06-08  176.0   O   3274137
9     슈가  방탄소년단      빅히트  남자  1993-03-09  176.0   O   4925442
10  강다니엘    NaN      커넥트  남자  1996-12-10  180.0   A   8273745
11    정국  방탄소년단      빅히트  남자  1997-09-01  178.0   A   7208335
12    화사    마마무      RBW  여자  1995-07-23  162.1   A   7650928
13   하성운     핫샷  스타크루이엔티  남자  1994-03-22  167.1   A   4036489
14    슬기   레드벨벳       SM  여자  1994-02-10  161.0   A   5021452
15    지민  방탄소년단      빅히트  남자  1995-10-13  173.6   A  10523260

In [76]:
# 최빈값이 2개 이상일 때 확인해 보기
df['키'].mode()

0    176.0
1    178.0
Name: 키, dtype: float64

In [80]:
print(type(df['키'].mode())) # Series : 1차원

<class 'pandas.core.series.Series'>

In [78]:
print(df['키'].mode()[0])

176.0

In [79]:
print(df['키'].mode()[1])

178.0

In [81]:
# 최빈값의 data 확인
df.loc[df["키"] == 178, :]

    이름     그룹  소속사  성별        생년월일      키 혈액형     인기지수
2    뷔  방탄소년단  빅히트  남자  1995-12-30  178.0  AB  8073501
11  정국  방탄소년단  빅히트  남자  1997-09-01  178.0   A  7208335

In [82]:
df.loc[df["키"] == 176, :]

   이름     그룹   소속사  성별        생년월일      키 혈액형     인기지수
8  JR   뉴이스트  플레디스  남자  1995-06-08  176.0   O  3274137
9  슈가  방탄소년단   빅히트  남자  1993-03-09  176.0   O  4925442

## 4. GroupBy (그룹으로 묶어 보기)
- groupby는 데이터를 그룹으로 묶어 분석할 때 활용합니다.
- 소속사별 키의 평균, 성별 키의 평균 등 특정, 그룹별 통계 및 데이터의 성질을 확인하고자 할 때 활용합니다.

In [83]:
df = pd.read_csv('datas/korea-star.csv')

In [84]:
df.head(3)

    이름     그룹   소속사  성별        생년월일      키 혈액형     인기지수
0  아이린   레드벨벳    SM  여자  1991-03-29  160.0   A  8256324
1  차은우   아스트로  판타지오  남자  1997-03-30  183.0   B  3506027
2    뷔  방탄소년단   빅히트  남자  1995-12-30  178.0  AB  8073501

In [85]:
df.value_counts('소속사')

소속사
빅히트        5
SM         3
플레디스       3
RBW        1
스타크루이엔티    1
커넥트        1
큐브         1
판타지오       1
Name: count, dtype: int64

In [86]:
df.groupby('소속사')

#### groupby와 함께
- count() - 갯수
- sum() - 합계
- mean() - 평균
- var() - 분산
- std() - 표준편차
- min()/max() - 최소값, 최대값

In [87]:
df.groupby('소속사').count()

         이름  그룹  성별  생년월일  키  혈액형  인기지수
소속사
RBW       1   1   1     1  1    1     1
SM        3   3   3     3  2    3     3
빅히트       5   5   5     5  5    5     5
스타크루이엔티   1   1   1     1  1    1     1
커넥트       1   0   1     1  1    1     1
큐브        1   1   1     1  0    1     1
판타지오      1   1   1     1  1    1     1
플레디스      3   2   3     3  3    3     3

In [88]:
df.value_counts('소속사')

소속사
빅히트        5
SM         3
플레디스       3
RBW        1
스타크루이엔티    1
커넥트        1
큐브         1
판타지오       1
Name: count, dtype: int64

In [89]:
df.groupby('그룹').sum()

,이름,소속사,성별,생년월일,키,혈액형,인기지수
그룹,,,,,,,
뉴이스트,백호JR,플레디스플레디스,남자남자,1995-07-211995-06-08,351.0,ABO,6575791
레드벨벳,아이린슬기,SMSM,여자여자,1991-03-291994-02-10,321.0,AA,13277776
마마무,화사,RBW,여자,1995-07-23,162.1,A,7650928
방탄소년단,뷔진슈가정국지민,빅히트빅히트빅히트빅히트빅히트,남자남자남자남자남자,1995-12-301992-12-041993-03-091997-09-011995-1...,882.8,ABOOAA,35300846
소녀시대,윤아,SM,여자,1989-03-09,0.0,A,3918661
아스트로,차은우,판타지오,남자,1997-03-30,183.0,B,3506027
아이들,소연,큐브,여자,1998-08-26,0.0,B,4668615
핫샷,하성운,스타크루이엔티,남자,1994-03-22,167.1,A,4036489

In [90]:
df.groupby('성별').sum()

,이름,그룹,소속사,생년월일,키,혈액형,인기지수
성별,,,,,,,
남자,차은우뷔민현진백호JR슈가강다니엘정국하성운지민,아스트로방탄소년단방탄소년단뉴이스트뉴이스트방탄소년단방탄소년단핫샷방탄소년단,판타지오빅히트플레디스빅히트플레디스플레디스빅히트커넥트빅히트스타크루이엔티빅히트,1997-03-301995-12-301995-08-091992-12-041995-0...,1946.2,BABOOABOOAAAA,62682690
여자,아이린소연윤아화사슬기,레드벨벳아이들소녀시대마마무레드벨벳,SM큐브SMRBWSM,1991-03-291998-08-261989-03-091995-07-231994-0...,483.1,ABAAA,29515980

In [91]:
df.head(3)

    이름     그룹   소속사  성별        생년월일      키 혈액형     인기지수
0  아이린   레드벨벳    SM  여자  1991-03-29  160.0   A  8256324
1  차은우   아스트로  판타지오  남자  1997-03-30  183.0   B  3506027
2    뷔  방탄소년단   빅히트  남자  1995-12-30  178.0  AB  8073501

In [92]:
df.groupby('혈액형')[['키','인기지수']].mean()

              키        인기지수
혈액형
A    168.828571  6861149.25
AB   176.500000  5687577.50
B    183.000000  4087321.00
O    177.875000  4439919.75

In [93]:
df.groupby('혈액형')[['키','인기지수']].var()

             키          인기지수
혈액형
A    69.862381  5.445530e+12
AB    4.500000  1.138526e+13
B          NaN  6.758054e+11
O    13.289167  6.380473e+11

In [94]:
df.groupby('혈액형')[['키','인기지수']].std()

            키          인기지수
혈액형
A    8.358372  2.333566e+06
AB   2.121320  3.374205e+06
B         NaN  8.220739e+05
O    3.645431  7.987786e+05

In [95]:
df.groupby('혈액형')[['키','인기지수']].min()

         키     인기지수
혈액형
A    160.0  3918661
AB   175.0  3301654
B    183.0  3506027
O    174.0  3274137

In [96]:
df.groupby('혈액형')[['키','인기지수']].max()

         키      인기지수
혈액형
A    180.0  10523260
AB   178.0   8073501
B    183.0   4668615
O    182.3   4989792

## 5. Multi-Index(복합 인덱스)

In [97]:
df = pd.read_csv("datas/korea-star.csv")

### 5-1. Multi-Index 적용
행 인덱스를 복합적으로 구성하고 싶은 경우는 인덱스를 리스트로 만들어줌

In [98]:
df.groupby(['혈액형', '성별'])[["키", "인기지수"]].mean()

                 키        인기지수
혈액형 성별
A   남자  174.675000  7510457.25
    여자  161.033333  6211841.25
AB  남자  176.500000  5687577.50
B   남자  183.000000  3506027.00
    여자         NaN  4668615.00
O   남자  177.875000  4439919.75

### 5-2. Multi-Index 데이터 프레임을 피벗 테이블로 변환
- PIVOT : (회전하는 물체의 균형을 잡아 주는) 중심점이라는 뜻
- 원하는 컬럼 기준에 따라 테이블은 제구성 할 수 있음

Multi-Index로 된 데이터프레임을 피벗테이블 형태로 다시 변환해 줄 수 있음

In [99]:
# 그룹 by 수행수 multi index 데이터 프레임 만들고,
df2 = df.groupby(['혈액형', '성별'])[["키", "인기지수"]].mean()

In [100]:
print(df2)

                 키        인기지수
혈액형 성별
A   남자  174.675000  7510457.25
    여자  161.033333  6211841.25
AB  남자  176.500000  5687577.50
B   남자  183.000000  3506027.00
    여자         NaN  4668615.00
O   남자  177.875000  4439919.75

In [101]:
print(df2.stack())

혈액형  성별
A    남자  키       1.746750e+02
         인기지수    7.510457e+06
     여자  키       1.610333e+02
         인기지수    6.211841e+06
AB   남자  키       1.765000e+02
         인기지수    5.687578e+06
B    남자  키       1.830000e+02
         인기지수    3.506027e+06
     여자  인기지수    4.668615e+06
O    남자  키       1.778750e+02
         인기지수    4.439920e+06
dtype: float64

In [102]:
# 혈액형 컬럼을 기준으로 피벗테이블 변형
print(df2.unstack('혈액형'))

              키                               인기지수
혈액형           A     AB      B        O           A         AB          B
성별
남자   174.675000  176.5  183.0  177.875  7510457.25  5687577.5  3506027.0  \
여자   161.033333    NaN    NaN      NaN  6211841.25        NaN  4668615.0


혈액형           O
성별
남자   4439919.75
여자          NaN

In [104]:
print(df2.unstack('성별'))

           키                    인기지수
성별        남자          여자          남자          여자
혈액형
A    174.675  161.033333  7510457.25  6211841.25
AB   176.500         NaN  5687577.50         NaN
B    183.000         NaN  3506027.00  4668615.00
O    177.875         NaN  4439919.75         NaN

## 5-3. 인덱스 초기화 (reset_index)
reset_index() 는 Multi-Index로 구성된 데이터 프레임의 **인덱스를 초기화**해줌.

In [111]:
df2

  혈액형  성별           키        인기지수
0   A  남자  174.675000  7510457.25
1   A  여자  161.033333  6211841.25
2  AB  남자  176.500000  5687577.50
3   B  남자  183.000000  3506027.00
4   B  여자         NaN  4668615.00
5   O  남자  177.875000  4439919.75

In [115]:
# axis = 0, 행 index 
df2 = df2.reset_index()

In [108]:
df2

  혈액형  성별           키        인기지수
0   A  남자  174.675000  7510457.25
1   A  여자  161.033333  6211841.25
2  AB  남자  176.500000  5687577.50
3   B  남자  183.000000  3506027.00
4   B  여자         NaN  4668615.00
5   O  남자  177.875000  4439919.75

In [116]:
df2.drop(["index"], axis=1)

  혈액형  성별           키        인기지수
0   A  남자  174.675000  7510457.25
1   A  여자  161.033333  6211841.25
2  AB  남자  176.500000  5687577.50
3   B  남자  183.000000  3506027.00
4   B  여자         NaN  4668615.00
5   O  남자  177.875000  4439919.75

# 6. 피벗테이블 (pivot_table)
- 피벗테이블은 엑셀의 피벗테이블과 동일함
- 데이터 열 중에서 **두 개의 열을 각각 행 인덱스, 열 인덱스로 사용**하여 데이터를 조회하여 펼쳐놓은 것을 의미함
- 왼쪽에 나타나는 인덱스를 **행 인덱스**, 상단에 나타나는 인덱스를 **열 인덱스**라고 부름

In [117]:
df.head()

    이름     그룹   소속사  성별        생년월일      키 혈액형     인기지수
0  아이린   레드벨벳    SM  여자  1991-03-29  160.0   A  8256324
1  차은우   아스트로  판타지오  남자  1997-03-30  183.0   B  3506027
2    뷔  방탄소년단   빅히트  남자  1995-12-30  178.0  AB  8073501
3   민현    NaN  플레디스  남자  1995-08-09  182.3   O  4989792
4   소연    아이들    큐브  여자  1998-08-26    NaN   B  4668615

In [118]:
# index는 행 인덱스
# columns는 열 인덱스
# values는 조회하고 싶은 값
pd.pivot_table(df, index='소속사', columns='혈액형', values='키')

혈액형          A     AB      B       O
소속사
RBW      162.1    NaN    NaN     NaN
SM       160.5    NaN    NaN     NaN
빅히트      175.8  178.0    NaN  176.60
스타크루이엔티  167.1    NaN    NaN     NaN
커넥트      180.0    NaN    NaN     NaN
판타지오       NaN    NaN  183.0     NaN
플레디스       NaN  175.0    NaN  179.15

In [119]:
# aggfunc에는 추가 계산 옵션 (np.sum, np.mean) - 기본값은 평균
pd.pivot_table(df, index='그룹', columns='혈액형', values='인기지수', aggfunc=np.mean)

혈액형            A         AB          B          O
그룹
뉴이스트         NaN  3301654.0        NaN  3274137.0
레드벨벳   6638888.0        NaN        NaN        NaN
마마무    7650928.0        NaN        NaN        NaN
방탄소년단  8865797.5  8073501.0        NaN  4747875.0
소녀시대   3918661.0        NaN        NaN        NaN
아스트로         NaN        NaN  3506027.0        NaN
아이들          NaN        NaN  4668615.0        NaN
핫샷     4036489.0        NaN        NaN        NaN